In [2]:
import pandas as pd
import glob

In [3]:
# get data file names
path =r'data'   # use your path
all_files = glob.glob(path + "/*.csv")

In [4]:
# read all csv files in the same folder 'data'
li = []

# Create a list of  data of each csv file 
for filename in all_files:
    df= pd.read_csv(filename, index_col=None, header='infer')
    li.append(df)

In [5]:
columns = [ i.columns for i in li ]   # list comprehension to extract column names of the 6 dataframe
columns

[Index(['dept_no', 'dept_name'], dtype='object'),
 Index(['emp_no', 'dept_no', 'from_date', 'to_date'], dtype='object'),
 Index(['dept_no', 'emp_no', 'from_date', 'to_date'], dtype='object'),
 Index(['emp_no', 'birth_date', 'first_name', 'last_name', 'gender',
        'hire_date'],
       dtype='object'),
 Index(['emp_no', 'salary', 'from_date', 'to_date'], dtype='object'),
 Index(['emp_no', 'title', 'from_date', 'to_date'], dtype='object')]

In [6]:
filename

'data\\titles.csv'

In [7]:
all_files

['data\\departments.csv',
 'data\\dept_emp.csv',
 'data\\dept_manager.csv',
 'data\\employees.csv',
 'data\\salaries.csv',
 'data\\titles.csv']

In [8]:
li[1].head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [9]:
li[2].head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21